# Напишіть скрипт, який обчислює площу прямокутника a*b, площу трикутника 0.5*h*a, площу кола pi*r**2 і цей скрипт 
# використати в іншому модулі, в якому ми запитуємо користувача площу якої фігури він хоче обчислити. 

# (для виконання завдання необхідно імпортувати  модуль math, а з нього функцію pow() 
# та значення змінної пі, модуль1, який містить 
# три функції для знаходження площ, модуль2, в якому імпортований модуль1 і 
# виконується основна логіка програми).

import math


def erea_rectangle(a, b):
    p_rectangle = a*b
    return p_rectangle

def erea_triangle(c, h):
    p_triangle = c * h * 0.5
    return p_triangle

def erea_circle(r):
    p_circle = math.pi * math.pow(r, 2)
    return p_circle

